pandas : 표형태의 데이터를 분석. 저장

DataFrame :  행(row, record),열(column, field)이루어짐. 2차원형태의 데이터
             Series 데이터의 모임
Series : 1차원형태의 데이터. 벡터

In [2]:
import pandas as pd #pip install pandas

In [3]:
#딕셔너리 데이터를 Series 데이터로 생성하기
dict_data = {'a':1,'b':2,'c':3}
sr = pd.Series(dict_data)
print(sr)
print(sr.values)

a    1
b    2
c    3
dtype: int64
[1 2 3]

In [9]:
#튜플데이터를 Series 데이터로 생성하기
tuple_data = ("홍길동","1990-01-01", '남',True,30)
sr = pd.Series(tuple_data,index=["이름","생일","성별","학생여부","나이"])
print(sr)
#인덱스값만 조회하기
print(sr.index)
#값만 조회하기
print(sr.values)

이름             홍길동
생일      1990-01-01
성별               남
학생여부          True
나이              30
dtype: object
Index(['이름', '생일', '성별', '학생여부', '나이'], dtype='object')
['홍길동' '1990-01-01' '남' True 30]

In [13]:
print(sr[0])  #i-index. 순서. 0부터시작
print(sr["이름"]) #인덱스
print(sr.이름) #인덱스
print(sr[1])  #i-index. 순서. 0부터시작
print(sr["생일"]) #인덱스
print(sr.생일) #인덱스

홍길동
홍길동
홍길동
1990-01-01
1990-01-01
1990-01-01

C:\Users\123rl\AppData\Local\Temp\ipykernel_8572\220494420.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[0])  #i-index. 순서. 0부터시작
C:\Users\123rl\AppData\Local\Temp\ipykernel_8572\220494420.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[1])  #i-index. 순서. 0부터시작

In [18]:
#여러개의 값 조회
print(sr[[0,1]])
#print(sr[0,1])  #오류
print(sr[["이름","생일"]])

이름           홍길동
생일    1990-01-01
dtype: object
이름           홍길동
생일    1990-01-01
dtype: object

C:\Users\123rl\AppData\Local\Temp\ipykernel_8572\1699553211.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[[0,1]])

In [22]:
#여러개의 값을 범위를 지정하여 조회
print(sr)
print(sr[0:3])  #순서로 조회. 0~2번째 순서 Series[첫번째순서:마지막순서+1]
print(sr["이름":"성별"])  #순서로 조회. 이름~성별 순서 Series[첫번째인덱스:마지막인덱스]

이름             홍길동
생일      1990-01-01
성별               남
학생여부          True
나이              30
dtype: object
이름           홍길동
생일    1990-01-01
성별             남
dtype: object
이름           홍길동
생일    1990-01-01
성별             남
dtype: object

In [25]:
#데이터프레임 객체 생성하기
#딕셔너리 이용
dict_data = {"c0":[1,2,3],"c1":[4,5,6],"c2":[7,8,9],"c3":[10,11,12],"c4":[13,14,15]}
df = pd.DataFrame(dict_data)
print(df)
print("컬럼명:",df.columns)
print("인덱스명:",df.index)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15
컬럼명: Index(['c0', 'c1', 'c2', 'c3', 'c4'], dtype='object')
인덱스명: RangeIndex(start=0, stop=3, step=1)

In [28]:
print(df["c0"])  #컬럼명으로 조회. 
print(type(df["c0"]))  #Series 데이터
print(df.c0)  #컬럼명으로 조회.

0    1
1    2
2    3
Name: c0, dtype: int64
<class 'pandas.core.series.Series'>
0    1
1    2
2    3
Name: c0, dtype: int64

In [32]:
#여러개의 컬럼 조회
print(df[["c0","c3"]])
print(type(df[["c0","c3"]]))
print(df[["c0"]])
print(type(df[["c0"]]))

   c0  c3
0   1  10
1   2  11
2   3  12
<class 'pandas.core.frame.DataFrame'>
   c0
0   1
1   2
2   3
<class 'pandas.core.frame.DataFrame'>

In [35]:
#리스트를 이용하여 데이터프레임 객체 생성
df = pd.DataFrame([[15,"남","서울중"],[17,"여","서울여고"],[17,"남","서울고"]],\
                  index=["홍길동","성춘향","이몽룡"],columns=["나이","성별","학교"])
print(df)
print("컬럼명:",df.columns)
print("인덱스명:",df.index)

     나이 성별    학교
홍길동  15  남   서울중
성춘향  17  여  서울여고
이몽룡  17  남   서울고
컬럼명: Index(['나이', '성별', '학교'], dtype='object')
인덱스명: Index(['홍길동', '성춘향', '이몽룡'], dtype='object')

In [37]:
#인덱스 변경하기
df.index = ["학생1","학생2","학생3"]
print(df)
#컬럼명 변경하기
df.columns=["age","gender","school"]
print(df)

     나이 성별    학교
학생1  15  남   서울중
학생2  17  여  서울여고
학생3  17  남   서울고
     age gender school
학생1   15      남    서울중
학생2   17      여   서울여고
학생3   17      남    서울고

In [39]:
#컬럼명의 일부만 수정하기
#inplace=True : 객체 자체를 변경
df.rename(columns={"age":"나이"},inplace=True)
print(df)

     나이 gender school
학생1  15      남    서울중
학생2  17      여   서울여고
학생3  17      남    서울고

In [41]:
df=df.rename(columns={"나이":"age"}) #inplace=True 를 사용하지 않으면 df에 대입하면 됨
print(df)

     age gender school
학생1   15      남    서울중
학생2   17      여   서울여고
학생3   17      남    서울고

In [43]:
#문제 : exam_data를 이용하여 인덱스는 홍길동,이몽룡,김삿갓인 DataFrame 객체 생성하기
exam_data={"수학":[90,80,70],"영어":[98,88,95],"음악":[85,95,100],"체육":[100,90,90]}
#1
df = pd.DataFrame(exam_data,index=["홍길동","이몽룡","김삿갓"])
print(df)
#2
df = pd.DataFrame(exam_data)
df.index=["홍길동","이몽룡","김삿갓"]
print(df)

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [46]:
#평균 구하기
print(df.mean())
print(type(df.mean()))

수학    80.000000
영어    93.666667
음악    93.333333
체육    93.333333
dtype: float64
<class 'pandas.core.series.Series'>

In [50]:
#수학평균
print("수학평균:",df.mean()["수학"])
print("수학평균:",df.mean().수학)
print("수학평균:",df.mean()[0])
print("수학평균:",df["수학"].mean())
print("수학평균:",df.수학.mean())

수학평균: 80.0
수학평균: 80.0
수학평균: 80.0
수학평균: 80.0
수학평균: 80.0

C:\Users\123rl\AppData\Local\Temp\ipykernel_8572\2633141806.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print("수학평균:",df.mean()[0])

In [51]:
#총점 : df.sum() 
print(df.sum())

수학    240
영어    281
음악    280
체육    280
dtype: int64

In [53]:
#수학 총점
print(df.sum()["수학"])
print(df["수학"].sum())

240
240

In [56]:
#최대점수 출력
print(df.max())
#수학최대점수
print(df.max()["수학"])
#최소점수 출력
print(df.min())
#수학최소점수
print(df.min()["수학"])

수학     90
영어     98
음악    100
체육    100
dtype: int64
90
수학    70
영어    88
음악    85
체육    90
dtype: int64
70

In [58]:
#중간값 : median.
# 데이터의 중간값 : 홀수 : 가운데값, 짝수:가운데값2의 평균
print(df)
print(df.median())

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
수학    80.0
영어    95.0
음악    95.0
체육    90.0
dtype: float64

In [61]:
print(df.수학.홍길동) #홍길동의 수학 점수 조회
#데이터프레임의 인덱스값조회하기
# loc[인덱스]
# iloc[순서]
#홍길동 데이터 조회하기
print(df.loc["홍길동"]) #인덱스 이름 홍길동인 행 조회
print(df.iloc[0])      # 첫번째 행 조회

90
수학     90
영어     98
음악     85
체육    100
Name: 홍길동, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 홍길동, dtype: int64

In [64]:
#홍길동, 김삿갓의 정보 조회하기
print(df.loc[["홍길동","김삿갓"]])
print(df.iloc[[0,2]])

     수학  영어   음악   체육
홍길동  90  98   85  100
김삿갓  70  95  100   90
     수학  영어   음악   체육
홍길동  90  98   85  100
김삿갓  70  95  100   90

In [66]:
#홍길동의 평균,총점 출력하기
print("홍길동의 평균:",df.loc["홍길동"].mean())
print("홍길동의 총점:",df.loc["홍길동"].sum())

홍길동의 평균: 93.25
홍길동의 총점: 373

In [83]:
#모든 학생의 평균 출력하기
print(df.mean(axis="columns")) #행기준 평균
print(df.mean(axis=1))         #행기준 평균
print(df.mean(axis="index"))   #열기준 평균
print(df.mean(axis=0))         #열기준 평균. 기본값
print(df.mean())         #열기준 평균

홍길동    93.25
이몽룡    88.25
김삿갓    88.75
dtype: float64
홍길동    93.25
이몽룡    88.25
김삿갓    88.75
dtype: float64
수학    80.000000
영어    93.666667
음악    93.333333
체육    93.333333
dtype: float64
수학    80.000000
영어    93.666667
음악    93.333333
체육    93.333333
dtype: float64
수학    80.000000
영어    93.666667
음악    93.333333
체육    93.333333
dtype: float64

In [86]:
#표준편차 : std, 분산 : var
# 분산 : (평균값 - 현재값) ** 2 의 합의 평균
# 표준편차 : sqrt(분산)
print(df.std())
print(df.var())

수학    10.000000
영어     5.131601
음악     7.637626
체육     5.773503
dtype: float64
수학    100.000000
영어     26.333333
음악     58.333333
체육     33.333333
dtype: float64

In [87]:
#기술통계 : 기본적인 수치데이트 분석
df.describe()

         수학         영어          음악          체육
count   3.0   3.000000    3.000000    3.000000
mean   80.0  93.666667   93.333333   93.333333
std    10.0   5.131601    7.637626    5.773503
min    70.0  88.000000   85.000000   90.000000
25%    75.0  91.500000   90.000000   90.000000
50%    80.0  95.000000   95.000000   90.000000
75%    85.0  96.500000   97.500000   95.000000
max    90.0  98.000000  100.000000  100.000000

In [89]:
#dataframe의 기본 정보
df.info()
df.수학.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 홍길동 to 김삿갓
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   수학      3 non-null      int64
 1   영어      3 non-null      int64
 2   음악      3 non-null      int64
 3   체육      3 non-null      int64
dtypes: int64(4)
memory usage: 228.0+ bytes
<class 'pandas.core.series.Series'>
Index: 3 entries, 홍길동 to 김삿갓
Series name: 수학
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 156.0+ bytes

In [90]:
df.head() #데이터 처음 5개만 출력
df.tail() #데이터 마지막 5개만 출력

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [92]:
#df 데이터 복사하기 => 얕은복사
df2 = df
print(df)
print(df2)
df.columns=["m","e","mu","p"]

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [94]:
print(df)
print(df2)

      m   e   mu    p
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
      m   e   mu    p
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [97]:
#df 데이터 복사하기 => 깊은복사
df2 =df[:]
print(df)
print(df2)
df.columns=["수학","영어","음악","체육"]

      m   e   mu    p
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
      m   e   mu    p
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [107]:
#drop : 행 또는 열을 제거
# axis = 0 : 행을 의미
# axis = 1 : 컬럼을 의미
# 행제거
df2=df[:]
#df2.drop(["홍길동"],axis=0,inplace=True)
df2 = df2.drop(["홍길동"],axis=0)
print(df2)

     수학  영어   음악  체육
이몽룡  80  88   95  90
김삿갓  70  95  100  90

In [108]:
print(df)
print(df2)

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
     수학  영어   음악  체육
이몽룡  80  88   95  90
김삿갓  70  95  100  90

In [109]:
#체육 제거하기
df2 = df[:]
df2 = df2.drop(["체육"],axis=1)
print(df2)

     수학  영어   음악
홍길동  90  98   85
이몽룡  80  88   95
김삿갓  70  95  100

In [110]:
#열 제거
del df2["음악"]
print(df2)

     수학  영어
홍길동  90  98
이몽룡  80  88
김삿갓  70  95

In [111]:
df3 = df.copy() #깊은 복사
print(df3)

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [112]:
del df3["음악"],df3["체육"]

In [113]:
print(df3)

     수학  영어
홍길동  90  98
이몽룡  80  88
김삿갓  70  95

In [114]:
#drop 함수를 이용하여 음악,체육 과목 제거 하기
df4 = df.copy()
df4 = df4.drop(["음악","체육"],axis=1)
print(df4)

     수학  영어
홍길동  90  98
이몽룡  80  88
김삿갓  70  95

In [116]:
#문제 : 김삿갓, 이몽룡 데이터만 조회하기
df.loc[["김삿갓","이몽룡"]]
df.loc["이몽룡":"김삿갓"]

     수학  영어   음악  체육
이몽룡  80  88   95  90
김삿갓  70  95  100  90

In [118]:
#전체 데이터
df.loc[:]
df.iloc[:]

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90